#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_api_management.main will be created
  + resource "azurerm_api_management" "main" {
      + developer_portal_url      = (known after apply)
      + gateway_regional_url      = (known after apply)
      + gateway_url               = (known after apply)
      + id                        = (known after apply)
      + location                  = "centralus"
      + management_api_url        = (known after apply)
      + name                      = "api-management-demo-apim"
      + notification_sender_email = (known after apply)
      + policy                    = (known after apply)
      + portal_url                = (known after apply)
      + private_ip_addresses      = (known after apply)
      + public_ip_addresses       = (known after apply)
      + publisher_email           = "is@pfl.com"
      + publisher_name            = "PFL"
      + resource_group_name       = "api-management-demo"
      + scm_url                   = (known after apply)
      + sku_name                  = "Consumption_0"
      + virtual_network_type      = "None"

      + protocols {
          + enable_http2 = (known after apply)
        }

      + security {
          + enable_backend_ssl30                                = (known after apply)
          + enable_backend_tls10                                = (known after apply)
          + enable_backend_tls11                                = (known after apply)
          + enable_frontend_ssl30                               = (known after apply)
          + enable_frontend_tls10                               = (known after apply)
          + enable_frontend_tls11                               = (known after apply)
          + enable_triple_des_ciphers                           = (known after apply)
          + tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = (known after apply)
          + tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = (known after apply)
          + tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = (known after apply)
          + tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = (known after apply)
          + tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = (known after apply)
          + tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = (known after apply)
          + tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = (known after apply)
          + triple_des_ciphers_enabled                          = (known after apply)
        }

      + sign_in {
          + enabled = (known after apply)
        }

      + sign_up {
          + enabled = (known after apply)

          + terms_of_service {
              + consent_required = (known after apply)
              + enabled          = (known after apply)
              + text             = (known after apply)
            }
        }
    }

  # azurerm_api_management_api.main will be created
  + resource "azurerm_api_management_api" "main" {
      + api_management_name   = "api-management-demo-apim"
      + display_name          = "Order API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "order-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "api-management-demo"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = false
      + subscription_required = true
      + version               = "2021-06-23"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  title: Order API
                  version: 2021-06-23
                servers:
                  - url: /api
                tags:
                  - name: Orders
                    description: Everything about orders
                paths:
                  /orders:
                    post:
                      summary: Create an order
                      tags:
                        - Orders
                      operationId: PostOrder
                      requestBody:
                        required: true
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/Order'
                      responses:
                        200:
                          description: Created order
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Order'
                    get:
                      summary: Get all orders
                      tags: 
                        - Orders
                      operationId: GetOrders
                      responses:
                        200:
                          description: Orders
                          content:
                            application/json:
                              schema:
                                type: array
                                items:
                                  $ref: '#/components/schemas/Order'
                  /orders/{orderId}:
                    get:
                      summary: Get an order by id
                      tags:
                        - Orders
                      operationId: GetOrderById
                      parameters:
                        - name: orderId
                          in: path
                          description: Id of the order to get
                          required: true
                          schema:
                            type: string
                            format: uuid
                      responses:
                        200:
                          description: Order
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Order'
                    put:
                      summary: Update an order by id
                      tags: 
                        - Orders
                      operationId: UpdateOrderById
                      parameters:
                        - name: orderId
                          in: path
                          description: Id of the order to update
                          required: true
                          schema:
                            type: string
                            format: uuid
                      requestBody:
                        required: true
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/Order'
                      responses:
                        200:
                          description: Updated order
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/Order'
                components:
                  schemas:
                    Order:
                      type: object
                      required:
                        - id
                        - name
                        - address
                        - email
                        - productId
                        - quantity
                      properties:
                        id:
                          type: string
                          format: uuid
                          readOnly: true
                        name:
                          type: string
                        address:
                          type: string
                        email:
                          type: string
                          format: email
                        productId:
                          type: integer
                        quantity:
                          type: integer
            EOT
        }

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # azurerm_api_management_api_version_set.main will be created
  + resource "azurerm_api_management_api_version_set" "main" {
      + api_management_name = "api-management-demo-apim"
      + display_name        = "API Versions"
      + id                  = (known after apply)
      + name                = "api-management-demo-apim-versions"
      + resource_group_name = "api-management-demo"
      + version_query_name  = "api-version"
      + versioning_scheme   = "Query"
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "centralus"
      + name     = "api-management-demo"
    }

  # random_id.server will be created
  + resource "random_id" "server" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "azi_id" = "1"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jaret32, Action: `pull_request`*